zephyrproject-rtos/hal_infineon/mtb-pdl-cat2/devices/include/gpio_psoc4100smax_48_qfn_auto.h
    /* P3.7 */
    P3_7_GPIO                       =  0,       /* SW controlled GPIO. */
    P3_7_MSC0_SENSE                 =  4,       /* msc[0].sense:37 */
    P3_7_MSC0_SHIELD                =  5,       /* msc[0].shield:37 */
    P3_7_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P3_7_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P3_7_TCPWM_LINE_COMPL3          =  8,       /* Digital Active - tcpwm.line_compl[3]:0 */
    P3_7_PASS0_DSI_CTB_CMP1         = 10,       /* Digital Active - pass[0].dsi_ctb_cmp1 */
    P3_7_AUDIOSS_TX_WS              = 11,       /* Digital Active - audioss.tx_ws:0 */
    P3_7_AUDIOSS0_TX_WS             = 11,       /* Digital Active - audioss[0].tx_ws:0:0 */
    P3_7_LCD_COM31                  = 12,       /* Digital Deep Sleep - lcd.com[31] */
    P3_7_LCD_SEG31                  = 13,       /* Digital Deep Sleep - lcd.seg[31] */
    P3_7_LPCOMP_COMP1               = 14,       /* Digital Deep Sleep - lpcomp.comp[1]:1 */
    P3_7_SCB2_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[2].spi_miso:1 */

    /* P4.0 */
    P4_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_0_MSC0_SENSE                 =  4,       /* msc[0].sense:44 */
    P4_0_MSC0_SHIELD                =  5,       /* msc[0].shield:44 */
    P4_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_0_SCB0_UART_RX               =  9,       /* Digital Active - scb[0].uart_rx:0 */
    P4_0_PASS0_DSI_SAR_DATA9        = 10,       /* Digital Active - pass[0].dsi_sar_data[9]:0 */
    P4_0_LCD_COM32                  = 12,       /* Digital Deep Sleep - lcd.com[32] */
    P4_0_LCD_SEG32                  = 13,       /* Digital Deep Sleep - lcd.seg[32] */
    P4_0_SCB0_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[0].i2c_scl:1 */
    P4_0_SCB0_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[0].spi_mosi:0 */

    /* P4.1 */
    P4_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_1_MSC0_SENSE                 =  4,       /* msc[0].sense:45 */
    P4_1_MSC0_SHIELD                =  5,       /* msc[0].shield:45 */
    P4_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_1_SCB0_UART_TX               =  9,       /* Digital Active - scb[0].uart_tx:0 */
    P4_1_LCD_COM33                  = 12,       /* Digital Deep Sleep - lcd.com[33] */
    P4_1_LCD_SEG33                  = 13,       /* Digital Deep Sleep - lcd.seg[33] */
    P4_1_SCB0_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[0].i2c_sda:1 */
    P4_1_SCB0_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[0].spi_miso:0 */

    /* P4.2 */
    P4_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_2_MSC0_SENSE                 =  4,       /* msc[0].sense:46 */
    P4_2_MSC0_SHIELD                =  5,       /* msc[0].shield:46 */
    P4_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_2_SCB0_UART_CTS              =  9,       /* Digital Active - scb[0].uart_cts:0 */
    P4_2_PASS0_DSI_SAR_DATA10       = 10,       /* Digital Active - pass[0].dsi_sar_data[10]:0 */
    P4_2_LCD_COM34                  = 12,       /* Digital Deep Sleep - lcd.com[34] */
    P4_2_LCD_SEG34                  = 13,       /* Digital Deep Sleep - lcd.seg[34] */
    P4_2_LPCOMP_COMP0               = 14,       /* Digital Deep Sleep - lpcomp.comp[0]:1 */
    P4_2_SCB0_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[0].spi_clk:0 */

    /* P4.3 */
    P4_3_GPIO                       =  0,       /* SW controlled GPIO. */
    P4_3_MSC0_SENSE                 =  4,       /* msc[0].sense:47 */
    P4_3_MSC0_SHIELD                =  5,       /* msc[0].shield:47 */
    P4_3_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P4_3_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P4_3_SCB0_UART_RTS              =  9,       /* Digital Active - scb[0].uart_rts:0 */
    P4_3_PASS0_DSI_SAR_DATA11       = 10,       /* Digital Active - pass[0].dsi_sar_data[11]:0 */
    P4_3_LCD_COM35                  = 12,       /* Digital Deep Sleep - lcd.com[35] */
    P4_3_LCD_SEG35                  = 13,       /* Digital Deep Sleep - lcd.seg[35] */
    P4_3_LPCOMP_COMP1               = 14,       /* Digital Deep Sleep - lpcomp.comp[1]:2 */
    P4_3_SCB0_SPI_SELECT0           = 15,       /* Digital Deep Sleep - scb[0].spi_select0:0 */

    /* P6.1 */
    P6_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_1_MSC0_SENSE                 =  4,       /* msc[0].sense:23 */
    P6_1_MSC0_SHIELD                =  5,       /* msc[0].shield:23 */
    P6_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_1_TCPWM_LINE_COMPL4          =  8,       /* Digital Active - tcpwm.line_compl[4]:1 */
    P6_1_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:0 */
    P6_1_MSC0_EXT_SYNC_CLK          = 10,       /* Digital Active - msc[0].ext_sync_clk:1 */
    P6_1_CANFD_TTCAN_RX0            = 11,       /* Digital Active - canfd.ttcan_rx[0]:0 */
    P6_1_LCD_COM49                  = 12,       /* Digital Deep Sleep - lcd.com[49] */
    P6_1_LCD_SEG49                  = 13,       /* Digital Deep Sleep - lcd.seg[49] */
    P6_1_SCB3_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[3].i2c_sda:1 */
    P6_1_SCB3_SPI_MISO              = 15,       /* Digital Deep Sleep - scb[3].spi_miso:0 */

    /* P6.2 */
    P6_2_GPIO                       =  0,       /* SW controlled GPIO. */
    P6_2_MSC0_SENSE                 =  4,       /* msc[0].sense:24 */
    P6_2_MSC0_SHIELD                =  5,       /* msc[0].shield:24 */
    P6_2_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P6_2_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P6_2_TCPWM_LINE5                =  8,       /* Digital Active - tcpwm.line[5]:0 */
    P6_2_SCB3_UART_CTS              =  9,       /* Digital Active - scb[3].uart_cts:0 */
    P6_2_MSC0_EXT_SYNC              = 10,       /* Digital Active - msc[0].ext_sync:1 */
    P6_2_CANFD_TTCAN_TX0            = 11,       /* Digital Active - canfd.ttcan_tx[0]:0 */
    P6_2_LCD_COM50                  = 12,       /* Digital Deep Sleep - lcd.com[50] */
    P6_2_LCD_SEG50                  = 13,       /* Digital Deep Sleep - lcd.seg[50] */
    P6_2_SCB3_SPI_CLK               = 15,       /* Digital Deep Sleep - scb[3].spi_clk:0 */

    /* P7.0 */
    P7_0_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_0_MSC1_SENSE                 =  4,       /* msc[1].sense:6 */
    P7_0_MSC1_SHIELD                =  5,       /* msc[1].shield:6 */
    P7_0_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_0_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_0_TCPWM_LINE0                =  8,       /* Digital Active - tcpwm.line[0]:2 */
    P7_0_SCB3_UART_RX               =  9,       /* Digital Active - scb[3].uart_rx:2 */
    P7_0_LCD_COM54                  = 12,       /* Digital Deep Sleep - lcd.com[54]:0 */
    P7_0_LCD_SEG54                  = 13,       /* Digital Deep Sleep - lcd.seg[54] */
    P7_0_SCB3_I2C_SCL               = 14,       /* Digital Deep Sleep - scb[3].i2c_scl:2 */
    P7_0_SCB3_SPI_MOSI              = 15,       /* Digital Deep Sleep - scb[3].spi_mosi:1 */

    /* P7.1 */
    P7_1_GPIO                       =  0,       /* SW controlled GPIO. */
    P7_1_MSC1_SENSE                 =  4,       /* msc[1].sense:7 */
    P7_1_MSC1_SHIELD                =  5,       /* msc[1].shield:7 */
    P7_1_AMUXA                      =  6,       /* AMUXBUS A connection. */
    P7_1_AMUXB                      =  7,       /* AMUXBUS B connection. */
    P7_1_TCPWM_LINE_COMPL0          =  8,       /* Digital Active - tcpwm.line_compl[0]:2 */
    P7_1_SCB3_UART_TX               =  9,       /* Digital Active - scb[3].uart_tx:2 */
    P7_1_LCD_COM55                  = 12,       /* Digital Deep Sleep - lcd.com[55]:0 */
    P7_1_LCD_SEG55                  = 13,       /* Digital Deep Sleep - lcd.seg[55] */
    P7_1_SCB3_I2C_SDA               = 14,       /* Digital Deep Sleep - scb[3].i2c_sda:2 */
    P7_1_SCB3_SPI_MISO              = 15        /* Digital Deep Sleep - scb[3].spi_miso:1 */
} en_hsiom_sel_t;

#endif /* _GPIO_PSOC4100SMAX_48_QFN_AUTO_H_ */


/* [] END OF FILE */
